-- phpMyAdmin SQL Dump
-- version 4.8.2
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: May 13, 2019 at 05:36 PM
-- Server version: 10.1.34-MariaDB
-- PHP Version: 7.2.8

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `hrm`
--

-- --------------------------------------------------------

--
-- Table structure for table `palikas`
--

CREATE TABLE `palikas` (
  `district_id` int(11) NOT NULL,
  `palika_id` int(11) NOT NULL,
  `palika_name` varchar(50) CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `palikas`
--

INSERT INTO `palikas` (`district_id`, `palika_id`, `palika_name`) VALUES
(1, 1, 'मुसिकोट नगरपालिका'),
(1, 2, 'मुसिकोट नगरपालिका'),
(1, 3, 'ईस्मा गाउँपालिका'),
(1, 4, 'कालीगण्डकी गाउँपालिका'),
(1, 5, 'गुल्मी दरबार गाउँपालिका'),
(1, 6, 'सत्यवती गाउँपालिका'),
(1, 7, 'चन्द्रकोट गाउँपालिका'),
(1, 8, 'रुरु गाउँपालिका'),
(1, 9, 'छत्रकोट गाउँपालिका'),
(1, 10, 'धुर्कोट गाउँपालिका'),
(1, 11, 'मदाने गाउँपालिका'),
(1, 12, 'मालिका गाउँपालिका'),
(2, 13, 'रामपुर नगरपालिका'),
(2, 14, 'तानसेन नगरपालिका'),
(2, 15, 'निस्दी गाउँपालिका'),
(2, 16, 'पूर्वखोला गाउँपालिका'),
(2, 17, 'रम्भा गाउँपालिका'),
(2, 18, 'माथागढी गाउँपालिका'),
(2, 19, 'तिनाउ गाउँपालिका'),
(2, 20, 'बगनासकाली गाउँपालिका'),
(2, 21, 'रिब्दिकोट गाउँपालिका'),
(2, 22, 'रैनादेवी छहरा गाउँपालिका'),
(3, 23, 'बुटवल उपमहानगरपालिका'),
(3, 24, 'देवदह नगरपालिका'),
(3, 25, 'लुम्बिनी सांस्कृतिक नगरपालिका'),
(3, 26, 'सैनामैना नगरपालिका'),
(3, 27, 'सिद्धार्थनगर नगरपालिका'),
(3, 28, 'तिलोत्तमा नगरपालिका'),
(3, 29, 'गैडहवा गाउँपालिका'),
(3, 30, 'कन्चन गाउँपालिका'),
(3, 31, 'कोटहीमाई गाउँपालिका'),
(3, 32, 'मर्चवारी गाउँपालिका'),
(3, 33, 'मायादेवी गाउँपालिका'),
(3, 34, 'ओमसतिया गाउँपालिका'),
(3, 35, 'रोहिणी गाउँपालिका'),
(3, 36, 'सम्मरीमाई गाउँपालिका'),
(3, 37, 'सियारी गाउँपालिका'),
(3, 38, 'शुद्धोधन गाउँपालिका'),
(4, 39, 'कपिलवस्तु नगरपालिका'),
(4, 40, 'बुद्धभूमी नगरपालिका'),
(4, 41, 'शिवराज नगरपालिका'),
(4, 42, 'महाराजगंज नगरपालिका'),
(4, 43, 'कृष्णनगर नगरपालिका'),
(4, 44, 'बाणगंगा नगरपालिका'),
(4, 45, 'मायादेवी गाउँपालिका'),
(4, 46, 'यसोधरा गाउँपालिका'),
(4, 47, 'सुद्धोधन गाउँपालिका'),
(4, 48, 'विजयनगर गाउँपालिका'),
(5, 49, 'सन्धिखर्क नगरपालिका'),
(5, 50, 'शितगंगा नगरपालिका'),
(5, 51, 'भूमिकास्थान नगरपालिका'),
(5, 52, 'छत्रदेव गाउँपालिका'),
(5, 53, 'पाणिनी गाउँपालिका'),
(5, 54, 'मालारानी गाउँपालिका'),
(6, 55, 'प्यूठान नगरपालिका'),
(6, 56, 'स्वर्गद्वारी नगरपालिका'),
(6, 57, 'गौमुखी गाउँपालिका'),
(6, 58, 'माण्डवी गाउँपालिका'),
(6, 59, 'सरुमारानी गाउँपालिका'),
(6, 60, 'मल्लरानी गाउँपालिका'),
(6, 61, 'नौवहिनी गाउँपालिका'),
(6, 62, 'झिमरुक गाउँपालिका'),
(6, 63, 'ऐरावती गाउँपालिका'),
(7, 64, 'रोल्पा नगरपालिका'),
(7, 65, 'त्रिवेणी गाउँपालिका'),
(7, 66, 'दुईखोली गाउँपालिका'),
(7, 67, 'माडी गाउँपालिका'),
(7, 68, 'रुन्टीगढी गाउँपालिका'),
(7, 69, 'लुङग्री गाउँपालिका'),
(7, 70, 'सुकिदह गाउँपालिका'),
(7, 71, 'सुनछहरी गाउँपालिका'),
(7, 72, 'सुवर्णावती गाउँपालिका'),
(7, 73, 'थवाङ गाउँपालिका'),
(8, 74, 'पुथा उत्तरगंगा गाउँपालिका'),
(8, 75, 'भूमे गाउँपालिका'),
(8, 76, 'सिस्ने गाउँपालिका'),
(9, 77, 'तुल्सीपुर उपमहानगरपालिका'),
(9, 78, 'घोराही उपमहानगरपालिका'),
(9, 79, 'लमही नगरपालिका'),
(9, 80, 'बंगलाचुली गाउँपालिका'),
(9, 81, 'दंगीशरण गाउँपालिका'),
(9, 82, 'गढवा गाउँपालिका'),
(9, 83, 'राजपुर गाउँपालिका'),
(9, 84, 'राप्ती गाउँपालिका'),
(9, 85, 'शान्तिनगर गाउँपालिका'),
(9, 86, 'बबई गाउँपालिका'),
(10, 87, 'नेपालगंज उपमहानगरपालिका'),
(10, 88, 'कोहलपुर नगरपालिका'),
(10, 89, 'नरैनापुर गाउँपालिका'),
(10, 90, 'राप्तीसोनारी गाउँपालिका'),
(10, 91, 'बैजनाथ गाउँपालिका'),
(10, 92, 'खजुरा गाउँपालिका'),
(10, 93, 'डुडुवा गाउँपालिका'),
(10, 94, 'जानकी गाउँपालिका'),
(11, 95, 'गुलरिया नगरपालिका'),
(11, 96, 'मधुवन नगरपालिका'),
(11, 97, 'राजापुर नगरपालिका'),
(11, 98, 'ठाकुरबाबा नगरपालिका'),
(11, 99, 'बाँसगढी नगरपालिका'),
(11, 100, 'बारबर्दिया नगरपालिका'),
(11, 101, 'बारबर्दिया नगरपालिका'),
(11, 102, 'गेरुवा गाउँपालिका'),
(12, 103, 'बर्दघाट नगरपालिका'),
(12, 104, 'रामग्राम नगरपालिका'),
(12, 105, 'सुनवल नगरपालिका'),
(12, 106, 'सुस्ता गाउँपालिका'),
(12, 107, 'पाल्हीनन्दन गाउँपालिका'),
(12, 108, 'प्रतापपुर गाउँपालिका'),
(12, 109, 'सरावल गाउँपालिका');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `palikas`
--
ALTER TABLE `palikas`
  ADD PRIMARY KEY (`palika_id`),
  ADD KEY `district_id` (`district_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `palikas`
--
ALTER TABLE `palikas`
  MODIFY `palika_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=110;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `palikas`
--
ALTER TABLE `palikas`
  ADD CONSTRAINT `palikas_ibfk_1` FOREIGN KEY (`district_id`) REFERENCES `districts` (`district_id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
